Revit 2026 API

# EvaluatedParameter Properties

---

The EvaluatedParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Definition | Definition of the parameter. |
|  | HasValue | This property is true when the parameter value was successfully obtained, false otherwise. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StorageType | The storage type describes the type that is used internally within the parameter to store its value. |
|  | Value | Evaluated value of the parameter. |

#### Reference

EvaluatedParameter Class

Autodesk.Revit.DB Namespace